Revit 2026 API

# ViewShapeBuilder Class

---

Builds and verifies a view-specific shape representation that would typically be stored in a DirectShape object. Currently limited to curve-based representations for plan and elevation views.

SystemObject Autodesk.Revit.DBShapeBuilder Autodesk.Revit.DBViewShapeBuilder

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ViewShapeBuilder : ShapeBuilder
```
```vb
Public Class ViewShapeBuilder
	Inherits ShapeBuilder
```
```cpp
public ref class ViewShapeBuilder : public ShapeBuilder
```
```fsharp
type ViewShapeBuilder =
    class
        inherit ShapeBuilder
    end
```

The ViewShapeBuilder type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ViewShapeBuilder | Default constructor for an ViewShapeBuilder object. |
|  | ViewShapeBuilder(DirectShapeTargetViewType) | A constructor for an ViewShapeBuilder object that takes a view type. It will infer the view normal from view type. View normal and view type are used to validate the geometry to be stored as a view-specific shape representation of a DirectShape object. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from ShapeBuilder) |
|  | ViewNormal | Normal of the view that will display the shape being built. Must be set explicitly before adding any geometry. Must be a unit vector. This is used to validate incoming geometry - it must be orthogonal to the viewNormal. |
|  | ViewType | View type where the view-specific shape currently being built will be used |

|  | Name | Description |
| --- | --- | --- |
|  | AddCurve | Add a curve to the GRep associated to this ViewShapeBuilder. |
|  | Dispose | (Inherited from ShapeBuilder) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | Reset | Clears the accumulated geometry and resets other ViewShapeBuilder parameters to invalid values. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |
|  | ValidateCurve(Curve) | Validates curve to be added to the view-specific shape being constructed. Called by AddCurve() to validate input. Expects a valid view normal to be set prior to the call. |
|  | ValidateCurve(Curve, DirectShapeTargetViewType) | Validates curve to be added to the view-specific shape being constructed. Called by AddCurve() to validate input. This function may be used to pre-validate the geometry being added to avoid AddCurve() throwing an InvalidArgumentException |
|  | ValidateShape |  |
|  | ValidateViewType | Validates the incoming view type. As of today, the only allowed view type is Plan. |

The validation functionality is used by DirectShape to validate the incoming shape.

#### Reference

Autodesk.Revit.DB Namespace